/*Задача 35.1

Выведите в консоль числа от 1 до 100.*/

/*let i = 1;
while(i <= 100) {
	console.log (i);
	i++;
}*/

/*Задача 35.2

Выведите в консоль числа 11 до 33.*/
/*let j = 11;
while(j <= 33) {
	console.log(j);
	++j;
}*/

/*Задача 35.3

Выведите в консоль четные числа в промежутке от 0 до 100.
let i = 0;
while(i <= 100) {
	console.log(i);
	i += 2;
}*/

/*Задача 35.4

Выведите в консоль нечетные числа в промежутке от 1 до 99.*/

/*let i = 1;
while(i <= 100) {
	console.log(i);
	i+=2;
}*/

/*Задача 35.5

Выведите в консоль числа от 30 до 0.*/

let i = 30;
while(i >= 0) {
	console.log(i);
	--i;
}