/*Задача 1

Сформируйте с помощью двух вложенных циклов следующий массив:

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]*/
/*let arr = [];
for(let i = 0; i < 3; i++) {
	arr[i] = [];
	for(let j = 0; j < 5; j++) {
		arr[i][j] = j + 1;
	}
}
console.log(arr);*/
/*let arr = [];
for(let i = 0; i < 3; i++) {
	arr[i] = [];
	for(let j = 0; j < 5; j++) {
		arr[i].push(j + 1);
	}
}
console.log(arr);
*/
/*Задача 2

Сформируйте с помощью двух вложенных циклов следующий массив:

[['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x'], ['x', 'x', 
	'x', 'x']] */
/*let arr = [];
for(let i = 0; i < 3;  i++) {
	arr[i] = [];
	for (let j = 0; j < 4; j++) {
		arr[i].push('x');
	}
}
console.log(arr);	
*/
/*Задача 3

Сформируйте с помощью трех вложенных циклов следующий массив:

[
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
]*/	
/*let arr = [];
for (let i = 0; i < 3; i++) {
	arr[i] = [];
	for(let j = 0; j < 2; j++) {
		arr[i][j] = [];
		for(let k = 0; k < 5; k++) {
			arr[i][j].push(k + 1);
		}
	}
}
console.log(arr);
console.log(typeof(arr));
let arr1 = '';
console.log(typeof(arr1));*/

/*Задача 15

Сформируйте с помощью двух вложенных циклов следующий массив:

[[1, 2], [3, 4], [5, 6], [7, 8]]*/
/*let arr = [];
for(let i = 0, k = 1; i < 4;  i++) {
	arr[i] = [];
	for(let j = 0; j < 2; j++) {
		arr[i][j] = k++;
		
	}
}
console.log(arr);
*//*Задача 16

Сформируйте с помощью двух вложенных циклов следующий массив:

[[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]*/
/*let arr = [];
for(let i = 0, k = 2; i < 4; i++) {
	arr[i] = [];
	for(let j = 0; j < 3; j++) {
		arr[i][j] = k += 2;
	}
}
console.log(arr);*/
/*Задача 17

Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:

[[[1, 2], [3, 4]], [[5, 6], [7, 8]]]*/
let arr = [];
for (let i = 0, k1 = 1; i < 2; i++) {
	arr[i] = [];
	for(let j = 0; j < 2;  j++) {
		arr[i][j] = [];
		for(let k = 0; k < 2;  k++) {
			arr[i][j][k] = k1++;
		}
	}
}
console.log(arr);